Improve documentation and logging
Signed-off-by: Will Killian <wkillian@nvidia.com>
